views/layouts/main.php

    ['target'=>'_blank']) : '';

//Get analytics if any
$analytics=Analytics::find()->all();
---
SELECT * FROM "analytics"