controllers/ProjectController.php

SELECT * FROM "jupyter_images"
SELECT * FROM "jupyter_limits" WHERE "user_type"='bronze'
SELECT COUNT(*) FROM "project_request" WHERE (("status" IN (1, 2)) AND ("project_type"=4) AND ("submitted_by"=217)) AND ("end_date" >= '2024-10-21')
---
    public function actionNewJupyterRequestNew()
    {
        $img=JupyterImages::find()->all();
        $images=[];
        foreach ($img as $i)
        {
            $description=$i->description;
            if ($i->gpu==true)
            {
                $description.=' (GPU)';
            }

            $images[$i->id]=$description;
        }

        $role=User::getRoleType();
        $jupyter_limits= JupyterLimits::find()->where(['user_type'=>$role])->one();
        $jupyter_maximum_number=$jupyter_limits->number_of_projects;
        //need to change project type
        $number_of_user_projects=ProjectRequest::find()->where(['status'=>[1,2],'project_type'=>4,'submitted_by'=>Userw::getCurrentUser()['id'],])->andWhere(['>=','end_date', date("Y-m-d")])->count();

SELECT * FROM "jupyter_autoaccept" WHERE "user_type"='bronze'
SELECT COUNT(*) FROM "project_request" WHERE (("status"=2) AND ("project_type"=4) AND ("submitted_by"=217)) AND ("end_date" >= '2024-10-21')
---
        $autoacceptModel=new JupyterAutoaccept;


        $jupyter_autoaccept= JupyterAutoaccept::find()->where(['user_type'=>$role])->one();
        $jupyter_autoaccept_number=$jupyter_autoaccept->autoaccept_number;
        //change project type
        $autoaccepted_num=ProjectRequest::find()->where(['status'=>2,'project_type'=>4,'submitted_by'=>Userw::getCurrentUser()['id'],])->andWhere(['>=','end_date', date("Y-m-d")])->count();