controllers/ProjectController.php

SELECT * FROM "configuration"
---
    public function actionIndex()
    {

        $configuration=Configuration::find()->one();

SELECT * FROM "ondemand_limits" WHERE "user_type"='bronze'
SELECT COUNT(*) FROM "project_request" WHERE (("status" IN (1, 2)) AND ("project_type"=0) AND ("submitted_by"=217)) AND ("end_date" >= '2024-10-21')
SELECT * FROM "ondemand_autoaccept" WHERE "user_type"='bronze'
SELECT COUNT(*) FROM "project_request" WHERE (("status"=2) AND ("project_type"=0) AND ("submitted_by"=217)) AND ("end_date" >= '2024-10-21')
---
    public function actionNewOndemandRequest()
    {

        $role=User::getRoleType();
        $ondemand_limits= OndemandLimits::find()->where(['user_type'=>$role])->one();
        $ondemand_maximum_number=$ondemand_limits->number_of_projects;
        $number_of_user_projects=ProjectRequest::find()->where(['status'=>[1,2],'project_type'=>0,'submitted_by'=>Userw::getCurrentUser()['id'],])->andWhere(['>=','end_date', date("Y-m-d")])->count();
        $new_project_allowed=($number_of_user_projects-$ondemand_maximum_number < 0) ? true :false;

        if((!$new_project_allowed) && (!Userw::hasRole('Admin', $superadminAllowed=true)) && (!Userw::hasRole('Moderator', $superadminAllowed=true)) )
        {
            return $this->render('no_project_allowed', ['project'=>"On-demand batch computations", 'user_type'=>$role]);
        }

        $ondemandModel=new OndemandRequest();
        $projectModel=new ProjectRequest;
        $limitsModel=new OndemandLimits;
        $autoacceptModel=new OndemandAutoaccept;

        $upperlimits=$limitsModel::find()->where(['user_type'=>$role])->one();

        $ondemand_autoaccept= OndemandAutoaccept::find()->where(['user_type'=>$role])->one();
        $ondemand_autoaccept_number=$ondemand_autoaccept->autoaccept_number;
        $autoaccepted_num=ProjectRequest::find()->where(['status'=>2,'project_type'=>0,'submitted_by'=>Userw::getCurrentUser()['id'],])->andWhere(['>=','end_date', date("Y-m-d")])->count();