controllers/SiteController.php

SELECT * FROM "configuration"
SELECT * FROM "pages" WHERE "id"=1
---
    public function actionIndex()
    {
        $config=Configuration::find()->one();
        $id=$config->home_page;
        $page=Page::find()->where(['id'=>$id])->one();