components/NotificationWidget.php

SELECT * FROM "notification" WHERE ("seen"=FALSE) AND ("recipient_id"=217)
---
    public static function createMenuItem()
    {
        $user=Userw::getCurrentUser()['id'];
        $notifications=Notification::find()->where(['seen'=>false])->andWhere(['recipient_id'=>$user])->all();