models/JupyterRequestNew.php

    public function init()
    {
        parent::init();

        $gold=Userw::hasRole('Gold',$superadminAllowed=false);
        $silver=Userw::hasRole('Silver',$superadminAllowed=false);
        if ($gold)
        {
            $this->role='gold';
        }
        else if ($silver)
        {
            $this->role='silver';
        }
        else
        {
            $this->role='bronze';
        }

        $this->limits=JupyterLimits::find()->where(['user_type'=>$this->role])->one();
---
SELECT * FROM "jupyter_limits" WHERE "user_type"='bronze'

    public function attributeLabels()
    {


        $autoaccept=JupyterAutoaccept::find()->where(['user_type'=>$this->role])->one();
---
SELECT * FROM "jupyter_autoaccept" WHERE "user_type"='bronze'