models/OndemandRequest.php

SELECT * FROM "ondemand_limits" WHERE "user_type"='bronze'
---
    public function init()
    {
        parent::init();

        $gold=Userw::hasRole('Gold',$superadminAllowed=false);
        $silver=Userw::hasRole('Silver',$superadminAllowed=false);
        if ($gold)
        {
            $this->role='gold';
        }
        else if ($silver)
        {
            $this->role='silver';
        }
        else
        {
            $this->role='bronze';
        }

        $this->limits=OndemandLimits::find()->where(['user_type'=>$this->role])->one();

SELECT * FROM "ondemand_autoaccept" WHERE "user_type"='bronze'
---
    public function attributeLabels()
    {


        $autoaccept=OndemandAutoaccept::find()->where(['user_type'=>$this->role])->one();