models/Project.php

SELECT "pr"."id", "p"."id" AS "project_id", "pr"."name", "pr"."end_date", "pr"."duration", "pr"."submission_date", "pr"."approval_date", "pr"."status", "pr"."viewed", "pr"."project_type", "username", "pr"."louros", "p"."favorite" FROM "project" "p" INNER JOIN "project_request" "pr" ON p.latest_project_request_id=pr.id INNER JOIN "user" "u" ON pr.submitted_by=u.id WHERE ("pr"."status" IN (1, 2)) AND ("end_date" >= '2024-10-21') AND ("pr"."submitted_by"=217)
---
    public static function getActiveProjectsOwner()
    {
        $query=new Query;

        $status=[1,2];
        $date=date("Y-m-d");

        $user=Userw::getCurrentUser()['id'];

        $query->select(['pr.id','p.id as project_id','pr.name','pr.end_date', 'pr.duration','pr.submission_date','pr.approval_date','pr.status','pr.viewed', 'pr.project_type','username', 'pr.louros', 'p.favorite'])
              ->from('project as p')
              ->innerJoin('project_request as pr','p.latest_project_request_id=pr.id')
              ->innerJoin('user as u','pr.submitted_by=u.id')
              ->where(['IN','pr.status',$status])
              ->andWhere(['>=', 'end_date', $date])
              ->andWhere(['pr.submitted_by'=>$user]);


        $results=$query->all();

SELECT "pr"."id", "p"."id" AS "project_id", "pr"."name", "pr"."end_date", "pr"."duration", "pr"."submission_date", "pr"."approval_date", "pr"."status", "pr"."viewed", "pr"."project_type", "u"."username", "pr"."louros", "p"."favorite" FROM "project" "p" INNER JOIN "project_request" "pr" ON p.latest_project_request_id=pr.id INNER JOIN "user" "u" ON pr.submitted_by=u.id WHERE ("pr"."status" IN (1, 2)) AND ("end_date" >= '2024-10-21') AND (217 = ANY(pr.user_list)) AND ("pr"."submitted_by" <> 217)
---
    public static function getActiveProjectsParticipant()
    {
        $query=new Query;

        $status=[1,2];
        $date=date("Y-m-d");

        $user=Userw::getCurrentUser()['id'];
        // print_r($user);
        // exit(0);

        $query->select(['pr.id','p.id as project_id','pr.name','pr.end_date', 'pr.duration','pr.submission_date','pr.approval_date','pr.status','pr.viewed', 'pr.project_type','u.username','pr.louros', 'p.favorite'])
              ->from('project as p')
              ->innerJoin('project_request as pr','p.latest_project_request_id=pr.id')
              ->innerJoin('user as u','pr.submitted_by=u.id')
              ->where(['IN','pr.status',$status])
              ->andWhere(['>=', 'end_date', $date])
              ->andWhere("$user = ANY(pr.user_list)")
              ->andWhere(['<>','pr.submitted_by',$user]);


        $results=$query->all();

SELECT "pr"."id", "pr"."name", "pr"."duration", "pr"."deletion_date", "pr"."status", "pr"."viewed", "pr"."project_type", "u"."username" FROM "project" "p" INNER JOIN "project_request" "pr" ON p.latest_project_request_id=pr.id INNER JOIN "user" "u" ON pr.submitted_by=u.id WHERE ("pr"."status"=-4) AND (217 = ANY(pr.user_list)) ORDER BY "pr"."submission_date" DESC
---
    public static function getDeletedProjects()
    {
        $query=new Query;

        $status=ProjectRequest::DELETED;

        $user=Userw::getCurrentUser()['id'];
        // print_r($user);
        // exit(0);

        $query->select(['pr.id','pr.name','pr.duration','pr.deletion_date','pr.status','pr.viewed', 'pr.project_type','u.username'])
              ->from('project as p')
              ->innerJoin('project_request as pr','p.latest_project_request_id=pr.id')
              ->innerJoin('user as u','pr.submitted_by=u.id')
              ->where(['IN','pr.status',$status])
              ->andWhere("$user = ANY(pr.user_list)")
              ->orderBy('pr.submission_date DESC');
        // print_r($query->createCommand()->getRawSql());
        // exit(0);

        $results=$query->all();

SELECT "pr"."id", "pr"."name", "pr"."duration", "pr"."end_date", "pr"."status", "pr"."viewed", "pr"."approval_date", "pr"."project_type", "u"."username" FROM "project" "p" INNER JOIN "project_request" "pr" ON p.latest_project_request_id=pr.id INNER JOIN "user" "u" ON pr.submitted_by=u.id WHERE ("end_date" < '2024-10-21') AND (217 = ANY(pr.user_list)) ORDER BY "pr"."submission_date" DESC
---
    public static function getExpiredProjects()
    {
        $query=new Query;

       // $status=ProjectRequest::EXPIRED;
        $date=date("Y-m-d");
        $user=Userw::getCurrentUser()['id'];
        // print_r($user);
        // exit(0);

        $query->select(['pr.id','pr.name','pr.duration',"pr.end_date",'pr.status','pr.viewed', 'pr.approval_date','pr.project_type','u.username'])
              ->from('project as p')
              ->innerJoin('project_request as pr','p.latest_project_request_id=pr.id')
              ->innerJoin('user as u','pr.submitted_by=u.id')
              ->where(['<','end_date',$date])
              ->andWhere("$user = ANY(pr.user_list)")
              ->orderBy('pr.submission_date DESC');
        // print_r($query->createCommand()->getRawSql());
        // exit(0);

        $results=$query->all();